data/NASA_2DWMH_sweep/exp_uniform_sst_500/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
180400
(
7.41002489226e-19
2.57747835775e-19
5.60096578535e-19
1.36934088811e-19
4.39426145979e-19
4.60258943305e-19
5.70886767847e-19
1.36934088837e-19
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
220
(
6.19466892636e-21
9.44352180507e-20
5.29182103959e-20
-9.75773502173e-20
2.73639328356e-20
-8.82836117868e-20
-8.75809867399e-20
5.47794239398e-20
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
220
(
-6.19466892636e-21
-9.44352180507e-20
-5.29182103959e-20
9.75773502173e-20
-2.73639328356e-20
8.82836117868e-20
8.75809867399e-20
-5.47794239398e-20
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
2.00543938836e-20
-8.24261355676e-20
2.00543938836e-20
7.86146963361e-20
2.00543938836e-20
-8.24261355676e-20
2.00543938836e-20
-8.24261355676e-20
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
-5.88676736236e-20
-7.49127520034e-20
-7.86038308964e-20
-7.86038308964e-20
1.26306521862e-19
-7.86038308964e-20
1.26306521862e-19
-1.07876738481e-19
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
