data/NASA_2DWMH_sweep/exp_uniform_sst_500/constant/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "constant";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
93600
(
-0.899450281477
-0.898136458097
-0.896466379807
-0.894586016194
-0.892643212935
-0.890785482165
-0.889047922466
-0.887349641043
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
-0.9
-0.9
-0.9
-0.9
-0.9
-0.9
-0.9
-0.9
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
0.67
0.67
0.67
0.67
0.67
0.67
0.67
0.67
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
520
(
-0.899450456449
-0.898136849805
-0.896466767345
-0.894586270089
-0.892643296303
-0.890785450498
-0.889047853239
-0.887349561082
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
520
(
-0.899170916529
-0.897510992736
-0.895847551517
-0.894180585418
-0.89251008697
-0.890836048688
-0.889158463071
-0.887477322602
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
