data/NASA_2DWMH_sweep/exp_uniform_sst_500/constant/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "constant";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
93600
(
-4.05485227244e-19
5.19648823842e-19
-5.38761186271e-19
6.79304718463e-20
2.72083732117e-19
2.42828623464e-20
-6.41488964584e-20
-7.83456678432e-21
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
6.60037083758e-20
-3.46944695195e-20
-4.448855119e-20
-9.2648817756e-20
5.10385933771e-20
-3.46944695195e-20
6.72211207848e-20
-4.38317928636e-20
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
-6.60037083758e-20
3.46944695195e-20
4.448855119e-20
9.2648817756e-20
-5.10385933771e-20
3.46944695195e-20
-6.72211207848e-20
4.38317928636e-20
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
520
(
4.27222771967e-20
-3.45924252659e-20
-5.29519338412e-20
4.37488153983e-20
-1.99671551936e-20
-7.44367706176e-20
-5.89213124166e-20
-3.79638402739e-20
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
520
(
-2.40522842923e-20
-2.83542404377e-21
3.94861124294e-20
-1.29867828397e-19
1.80678139409e-20
-6.6284898583e-20
-3.17083993866e-21
-2.42088123978e-20
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
