data/NASA_2DWMH_sweep/exp_uniform_sst_500/system/residuals
type            residuals;
libs            ("libutilityFunctionObjects.so");
writeControl    timeStep;
writeInterval   1;

#include "../fieldDef"

fields          $residualFields;
