data/NASA_2DWMH_sweep/exp_uniform_sst_500/system/singleGraph_x100
type            sets;
libs            ("libsampling.so");
writeControl    writeTime;
setFormat       raw;
interpolationScheme cell;

#include "../fieldDef"

fields          $singleGraphFields;

sets
(
    line
    {
        type        uniform;
        axis        xyz;
        nPoints     240;
        start       (0.42 0 0);
        end         (0.42 0.35 0);
    }
);
